backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, 3]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Activation
    config: {activation: relu, name: activation_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_2
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_4
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Activation
    config: {activation: relu, name: activation_4, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_5
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: Activation
    config: {activation: relu, name: activation_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_9
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Activation
    config: {activation: relu, name: activation_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_7
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_10
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Activation
    config: {activation: relu, name: activation_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Activation
    config: {activation: relu, name: activation_10, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_1
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: average_pooling2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_6
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_8
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_11
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_12
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Activation
    config: {activation: relu, name: activation_6, trainable: true}
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: Activation
    config: {activation: relu, name: activation_8, trainable: true}
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Activation
    config: {activation: relu, name: activation_11, trainable: true}
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Activation
    config: {activation: relu, name: activation_12, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Concatenate
    config: {axis: 3, name: mixed_5b, trainable: true}
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - &id002 {}
      - - activation_8
        - 0
        - 0
        - *id002
      - - activation_11
        - 0
        - 0
        - *id002
      - - activation_12
        - 0
        - 0
        - *id002
    name: mixed_5b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_16
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_16
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: batch_normalization_16
  - class_name: Activation
    config: {activation: relu, name: activation_16, trainable: true}
    inbound_nodes:
    - - - batch_normalization_16
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_14
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_17
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_14
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_17
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - {}
    name: batch_normalization_17
  - class_name: Activation
    config: {activation: relu, name: activation_14, trainable: true}
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Activation
    config: {activation: relu, name: activation_17, trainable: true}
    inbound_nodes:
    - - - batch_normalization_17
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_13
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_15
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_18
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_15
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_18
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_18
        - 0
        - 0
        - {}
    name: batch_normalization_18
  - class_name: Activation
    config: {activation: relu, name: activation_13, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: Activation
    config: {activation: relu, name: activation_15, trainable: true}
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Activation
    config: {activation: relu, name: activation_18, trainable: true}
    inbound_nodes:
    - - - batch_normalization_18
        - 0
        - 0
        - {}
    name: activation_18
  - class_name: Concatenate
    config: {axis: 3, name: block35_1_mixed, trainable: true}
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - &id003 {}
      - - activation_15
        - 0
        - 0
        - *id003
      - - activation_18
        - 0
        - 0
        - *id003
    name: block35_1_mixed
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: block35_1_conv
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - block35_1_mixed
        - 0
        - 0
        - {}
    name: block35_1_conv
  - class_name: Lambda
    config:
      arguments: {scale: 0.17}
      function: !!python/tuple [!!python/unicode 'YwIAAAACAAAAAwAAAFMAAABzFAAAAHwAAGQBABl8AABkAgAZfAEAFBdTKAMAAABOaQAAAABpAQAA

          ACgAAAAAKAIAAAB0BgAAAGlucHV0c3QFAAAAc2NhbGUoAAAAACgAAAAAcwwAAABpbl9yZXNuZXQu

          cHl0CAAAADxsYW1iZGE+pAAAAHMAAAAA

          ', null, null]
      function_type: lambda
      name: block35_1
      output_shape: !!python/tuple [null, null, 320]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - &id004 {}
      - - block35_1_conv
        - 0
        - 0
        - *id004
    name: block35_1
  - class_name: Activation
    config: {activation: relu, name: block35_1_ac, trainable: true}
    inbound_nodes:
    - - - block35_1
        - 0
        - 0
        - {}
    name: block35_1_ac
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_22
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_22
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_22
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_22
        - 0
        - 0
        - {}
    name: batch_normalization_22
  - class_name: Activation
    config: {activation: relu, name: activation_22, trainable: true}
    inbound_nodes:
    - - - batch_normalization_22
        - 0
        - 0
        - {}
    name: activation_22
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_20
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_20
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_23
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_22
        - 0
        - 0
        - {}
    name: conv2d_23
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_20
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_20
        - 0
        - 0
        - {}
    name: batch_normalization_20
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_23
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_23
        - 0
        - 0
        - {}
    name: batch_normalization_23
  - class_name: Activation
    config: {activation: relu, name: activation_20, trainable: true}
    inbound_nodes:
    - - - batch_normalization_20
        - 0
        - 0
        - {}
    name: activation_20
  - class_name: Activation
    config: {activation: relu, name: activation_23, trainable: true}
    inbound_nodes:
    - - - batch_normalization_23
        - 0
        - 0
        - {}
    name: activation_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_19
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_21
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_20
        - 0
        - 0
        - {}
    name: conv2d_21
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_24
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_23
        - 0
        - 0
        - {}
    name: conv2d_24
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_19
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_19
        - 0
        - 0
        - {}
    name: batch_normalization_19
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_21
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_21
        - 0
        - 0
        - {}
    name: batch_normalization_21
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_24
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_24
        - 0
        - 0
        - {}
    name: batch_normalization_24
  - class_name: Activation
    config: {activation: relu, name: activation_19, trainable: true}
    inbound_nodes:
    - - - batch_normalization_19
        - 0
        - 0
        - {}
    name: activation_19
  - class_name: Activation
    config: {activation: relu, name: activation_21, trainable: true}
    inbound_nodes:
    - - - batch_normalization_21
        - 0
        - 0
        - {}
    name: activation_21
  - class_name: Activation
    config: {activation: relu, name: activation_24, trainable: true}
    inbound_nodes:
    - - - batch_normalization_24
        - 0
        - 0
        - {}
    name: activation_24
  - class_name: Concatenate
    config: {axis: 3, name: block35_2_mixed, trainable: true}
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - &id005 {}
      - - activation_21
        - 0
        - 0
        - *id005
      - - activation_24
        - 0
        - 0
        - *id005
    name: block35_2_mixed
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: block35_2_conv
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - block35_2_mixed
        - 0
        - 0
        - {}
    name: block35_2_conv
  - class_name: Lambda
    config:
      arguments: {scale: 0.17}
      function: !!python/tuple [!!python/unicode 'YwIAAAACAAAAAwAAAFMAAABzFAAAAHwAAGQBABl8AABkAgAZfAEAFBdTKAMAAABOaQAAAABpAQAA

          ACgAAAAAKAIAAAB0BgAAAGlucHV0c3QFAAAAc2NhbGUoAAAAACgAAAAAcwwAAABpbl9yZXNuZXQu

          cHl0CAAAADxsYW1iZGE+pAAAAHMAAAAA

          ', null, null]
      function_type: lambda
      name: block35_2
      output_shape: !!python/tuple [null, null, 320]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - &id006 {}
      - - block35_2_conv
        - 0
        - 0
        - *id006
    name: block35_2
  - class_name: Activation
    config: {activation: relu, name: block35_2_ac, trainable: true}
    inbound_nodes:
    - - - block35_2
        - 0
        - 0
        - {}
    name: block35_2_ac
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_28
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_2_ac
        - 0
        - 0
        - {}
    name: conv2d_28
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_28
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_28
        - 0
        - 0
        - {}
    name: batch_normalization_28
  - class_name: Activation
    config: {activation: relu, name: activation_28, trainable: true}
    inbound_nodes:
    - - - batch_normalization_28
        - 0
        - 0
        - {}
    name: activation_28
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_26
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_2_ac
        - 0
        - 0
        - {}
    name: conv2d_26
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_29
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_28
        - 0
        - 0
        - {}
    name: conv2d_29
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_26
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_26
        - 0
